In [1]:
import numpy as np
import pandas as pd

In [21]:
df = pd.read_csv('data/gapminder.tsv', sep='\t')
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165877
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846989
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [8]:
df.head(100)

        country continent  year  lifeExp       pop     gdpPercap
0   Afghanistan      Asia  1952   28.801   8425333    779.445314
1   Afghanistan      Asia  1957   30.332   9240934    820.853030
2   Afghanistan      Asia  1962   31.997  10267083    853.100710
3   Afghanistan      Asia  1967   34.020  11537966    836.197138
4   Afghanistan      Asia  1972   36.088  13079460    739.981106
..          ...       ...   ...      ...       ...           ...
95      Bahrain      Asia  2007   75.635    708573  29796.048340
96   Bangladesh      Asia  1952   37.484  46886859    684.244172
97   Bangladesh      Asia  1957   39.348  51365468    661.637458
98   Bangladesh      Asia  1962   41.216  56839289    686.341554
99   Bangladesh      Asia  1967   43.453  62821884    721.186086

[100 rows x 6 columns]

In [10]:
df.tail(10)

       country continent  year  lifeExp       pop   gdpPercap
1694  Zimbabwe    Africa  1962   52.358   4277736  527.272182
1695  Zimbabwe    Africa  1967   53.995   4995432  569.795071
1696  Zimbabwe    Africa  1972   55.635   5861135  799.362176
1697  Zimbabwe    Africa  1977   57.674   6642107  685.587682
1698  Zimbabwe    Africa  1982   60.363   7636524  788.855041
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [17]:
import os
os.getcwd()

'D:\\AIclass\\DataAnalysis'

In [22]:
df[['country', 'lifeExp']].head()

       country  lifeExp
0  Afghanistan   28.801
1  Afghanistan   30.332
2  Afghanistan   31.997
3  Afghanistan   34.020
4  Afghanistan   36.088

In [33]:
df.tail(1).iloc[0,:]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [35]:
df.loc[len(df)-1,:]

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [37]:
df['country'].value_counts()

Myanmar                     12
Nicaragua                   12
Central African Republic    12
Jordan                      12
Finland                     12
                            ..
Tunisia                     12
Sri Lanka                   12
Switzerland                 12
Egypt                       12
Portugal                    12
Name: country, Length: 142, dtype: int64

In [43]:
result = df['country'].unique()
len(result)

142

In [46]:
df['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [56]:
df['lifeExp'].max()

82.603

In [57]:
df['lifeExp'].min()

23.599

In [59]:
df.index = df['country']

In [70]:
a = df.loc['Korea, Rep.',:]
print(a)
len(a)

                 country continent  year  lifeExp       pop     gdpPercap
country
Korea, Rep.  Korea, Rep.      Asia  1952   47.453  20947571   1030.592226
Korea, Rep.  Korea, Rep.      Asia  1957   52.681  22611552   1487.593537
Korea, Rep.  Korea, Rep.      Asia  1962   55.292  26420307   1536.344387
Korea, Rep.  Korea, Rep.      Asia  1967   57.716  30131000   2029.228142
Korea, Rep.  Korea, Rep.      Asia  1972   62.612  33505000   3030.876650
Korea, Rep.  Korea, Rep.      Asia  1977   64.766  36436000   4657.221020
Korea, Rep.  Korea, Rep.      Asia  1982   67.123  39326000   5622.942464
Korea, Rep.  Korea, Rep.      Asia  1987   69.810  41622000   8533.088805
Korea, Rep.  Korea, Rep.      Asia  1992   72.244  43805450  12104.278720
Korea, Rep.  Korea, Rep.      Asia  1997   74.647  46173816  15993.527960
Korea, Rep.  Korea, Rep.      Asia  2002   77.045  47969150  19233.988180
Korea, Rep.  Korea, Rep.      Asia  2007   78.623  49044790  23348.139730

12

In [73]:
kor = df[df['country'] == 'Korea, Rep.']
kor

                 country continent  year  lifeExp       pop     gdpPercap
country
Korea, Rep.  Korea, Rep.      Asia  1952   47.453  20947571   1030.592226
Korea, Rep.  Korea, Rep.      Asia  1957   52.681  22611552   1487.593537
Korea, Rep.  Korea, Rep.      Asia  1962   55.292  26420307   1536.344387
Korea, Rep.  Korea, Rep.      Asia  1967   57.716  30131000   2029.228142
Korea, Rep.  Korea, Rep.      Asia  1972   62.612  33505000   3030.876650
Korea, Rep.  Korea, Rep.      Asia  1977   64.766  36436000   4657.221020
Korea, Rep.  Korea, Rep.      Asia  1982   67.123  39326000   5622.942464
Korea, Rep.  Korea, Rep.      Asia  1987   69.810  41622000   8533.088805
Korea, Rep.  Korea, Rep.      Asia  1992   72.244  43805450  12104.278720
Korea, Rep.  Korea, Rep.      Asia  1997   74.647  46173816  15993.527960
Korea, Rep.  Korea, Rep.      Asia  2002   77.045  47969150  19233.988180
Korea, Rep.  Korea, Rep.      Asia  2007   78.623  49044790  23348.139730

In [83]:
round(kor['lifeExp'].min(),1)

47.5

In [84]:
round(kor['lifeExp'].max(),1)

78.6

In [87]:
df['lifeExp'].max()

82.603

In [88]:
df[df['lifeExp']==df['lifeExp'].max()]

        country continent  year  lifeExp        pop    gdpPercap
country
Japan     Japan      Asia  2007   82.603  127467972  31656.06806

In [89]:
df[df['lifeExp']==df['lifeExp'].min()]

        country continent  year  lifeExp      pop   gdpPercap
country
Rwanda   Rwanda    Africa  1992   23.599  7290203  737.068595

In [90]:
df[df['gdpPercap']==df['gdpPercap'].max()]

        country continent  year  lifeExp     pop    gdpPercap
country
Kuwait   Kuwait      Asia  1957   58.033  212846  113523.1329

In [91]:
df[df['pop']==df['pop'].max()]

        country continent  year  lifeExp         pop    gdpPercap
country
China     China      Asia  2007   72.961  1318683096  4959.114854

In [92]:
df[df['pop']==df['pop'].min()]

,country,continent,year,lifeExp,pop,gdpPercap
country,,,,,,
Sao Tome and Principe,Sao Tome and Principe,Africa,1952,46.471,60011,879.583586

In [97]:
pd.read_excel('data/teenage_mental.xls')

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2018,구분,42.7,34.5,51.5,29.6,24.2,35.4,15.4,11.8,19.2

In [101]:
df = pd.read_excel('data/teenage_mental.xls', header=1, usecols="C:K")
df

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  42.7  34.5  51.5  29.6   24.2   35.4  15.4   11.8   19.2

In [100]:
pd.read_excel('data/teenage_mental.xls', header=1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2018  구분  42.7  34.5  51.5  29.6   24.2   35.4  15.4   11.8   19.2

In [106]:
col_name = ['스트레스','스트레스남학생','스트레스여학생','우울감','우울감남학생','우울감여학생','자살생각율','자살생각율남학생','자살생각율여학생']
df.columns = col_name

In [107]:
df

   스트레스  스트레스남학생  스트레스여학생   우울감  우울감남학생  우울감여학생  자살생각율  자살생각율남학생  자살생각율여학생
0  42.7     34.5     51.5  29.6    24.2    35.4   15.4      11.8      19.2

In [108]:
df = pd.read_excel('data/teenage_mental.xls',names=col_name, header=1, usecols="C:K")
df

   스트레스  스트레스남학생  스트레스여학생   우울감  우울감남학생  우울감여학생  자살생각율  자살생각율남학생  자살생각율여학생
0  42.7     34.5     51.5  29.6    24.2    35.4   15.4      11.8      19.2

In [110]:
df.loc[1,:] = 100-df.loc[0,:]
df

   스트레스  스트레스남학생  스트레스여학생   우울감  우울감남학생  우울감여학생  자살생각율  자살생각율남학생  자살생각율여학생
0  42.7     34.5     51.5  29.6    24.2    35.4   15.4      11.8      19.2
1  57.3     65.5     48.5  70.4    75.8    64.6   84.6      88.2      80.8

In [112]:
df.loc[:,'응답'] = ['그렇다','아니다']
df

,스트레스,스트레스남학생,스트레스여학생,우울감,우울감남학생,우울감여학생,자살생각율,자살생각율남학생,자살생각율여학생,응답
0,42.7,34.5,51.5,29.6,24.2,35.4,15.4,11.8,19.2,그렇다
1,57.3,65.5,48.5,70.4,75.8,64.6,84.6,88.2,80.8,아니다

In [117]:
df.loc[0:3]

,스트레스,스트레스남학생,스트레스여학생,우울감,우울감남학생,우울감여학생,자살생각율,자살생각율남학생,자살생각율여학생,응답
0,42.7,34.5,51.5,29.6,24.2,35.4,15.4,11.8,19.2,그렇다
1,57.3,65.5,48.5,70.4,75.8,64.6,84.6,88.2,80.8,아니다

In [122]:
df.set_index('응답', inplace = True)

In [123]:
df

     스트레스  스트레스남학생  스트레스여학생   우울감  우울감남학생  우울감여학생  자살생각율  자살생각율남학생  자살생각율여학생
응답
그렇다  42.7     34.5     51.5  29.6    24.2    35.4   15.4      11.8      19.2
아니다  57.3     65.5     48.5  70.4    75.8    64.6   84.6      88.2      80.8